# Задача 80. Измерена е дължината на дясното ухо на 66 случайно избрани жени на възраст 
# между 18 и 30 години. Резултатите показват средна дължина 61.9 мм и стандартно
# отклонение 4 мм. Нека предположим, че популационната дисперсия е известна и 𝜎2 = (4.1)^2
# а) Намерете 95-процентен доверителен интервал за средната дължина на дясното ухо
# на жените на възраст между 18 и 30 години.
# б) Ако са направени измервания на 88 жени и са получени същите резултати за средната дължина 
# и стандартното отклонение, намерете 95-процентен доверителен интервал за средната дължина 
# на дясното ухо на жените на възраст между 18 и 30 години.

z1.ci <- function(x.bar, sigma, n, alpha){
  b1 <- x.bar - qnorm(1-alpha/2)*(sigma/sqrt(n))
  b2 <- x.bar + qnorm(1-alpha/2)*(sigma/sqrt(n))
  c(b1, b2)
}

z1.ci(61.9, 4, 66, 0.05)
z1.ci(61.9, 4, 88, 0.05)



# Задача 81. Кадмият е тежък метал, който може да се натрупа до високи нива в гъбите.
# Измерена е концентрацията на кадмий в случайна извадка от 10 горски гъби събрани в
# дадена местност. Резултатите са следните (в мг/кг):
#   3.1 3.0 3.7 2.6 4.2 3.8 3.6 2.7 3.8 4.4
# Може да предположим, че концентрацията на кадмий е нормално разпределена.
# а) Намерете 95-процентен доверителен интервал за средната концентрация на кадмий
# в горските гъбите в дадената местност.
# б) Намерете 90-процентен доверителен интервал за средната концентрация на кадмий
# в горските гъбите в дадената местност.

x <- c(3.1, 3.0, 3.7, 2.6, 4.2, 3.8, 3.6, 2.7, 3.8, 4.4)

t1.ci <- function(x.bar, s, n, alpha) {
  b1 <- x.bar - qt(1-alpha/2, df=n-1)*(s/sqrt(n))
  b2 <- x.bar + qt(1-alpha/2, df=n-1)*(s/sqrt(n))
  c(b1, b2)
}

t1.ci(mean(x), sd(x), length(x), 0.05)
t1.ci(mean(x), sd(x), length(x), 0.10)






