# Задача 73. Направена е извадка от 200 болта, произведени от машина А и 200 болта,
# произведени от машина В. Дефектни се оказали 8 болта произведени от първата машина
# и 15 болта произведени от втората. Може ли да се твърди, че двете машини се различават
# по отношение на вероятността да произведат дефектен болт?

# p1 = Вероятността машина А да произведе дефектен болт
# p2 = Вероятността машина В да произведе дефектен болт
# H0: p1 = p2
# H1: p1 != p2

x <- c(8, 15)
n <- c(200, 200)
prop.test(x, n, correct=F)$p.value <= 0.05
# => Не може да се твърди, че вероятностите се различават


# Задача 76. Генерирайте данни 𝑥1, 𝑥2, . . . , 𝑥𝑛 от 𝒩 (𝜇 = 5, 𝜎2 = 1) и данни 
# 𝑦1, 𝑦2, . . . , 𝑦𝑛 от 𝒩 (𝜇 = 5.2, 𝜎2 = 1). 
# Проверете хипотезата за равенство на средните. Повторете 10000 пъти
# за 𝑛 = 20, 50, 100, 500, 1000. В каква част от случаите нулевата хипотеза се отхвърля?

# mu_X - Средно на първогенерираните
# mu_Y - Средно на първогенерираните
# H0: mu_X = mu_Y
# H1: mu_X != mu_Y

generate.data <- function(n){
  dt1 <- rnorm(n, 5, 1)
  dt2 <- rnorm(n, 5.2, 1)
  t.test(dt1, dt2)$p.value <= 0.05  
}

res <- replicate(10000, generate.data(20))
sum(res)/length(res)
res <- replicate(10000, generate.data(50))
sum(res)/length(res)
res <- replicate(10000, generate.data(100))
sum(res)/length(res)
res <- replicate(10000, generate.data(500))
sum(res)/length(res)
res <- replicate(10000, generate.data(1000))
sum(res)/length(res)


# Задача 77. При проучване направено през 2007 година от 500 анкетирани 26 били вегетарианци. 
# През 2019 година е направено ново проучване, според което 43 от 540 анкетирани
# отговорили, че са вегетарианци. Дават ли ни тези данни основание да твърдим, че процентът 
# на вегетарианците през 2019 година се е увеличил спрямо 2007 година?

# p_x = вероятността анкетиран да е вегетарианец през 2007
# p_y = вероятността анкетиран да е вегетарианец през 2019
# H0: p_x = p_y
# H1: p_x < p_y

n1 <- 500
x1 <- 26
n2 <- 540
x2 <- 43
prop.test(c(x1, x2), c(n1, n2), alternative = 'less', correct = F)$p.value <= 0.05
# Отхвърляме H0 в полза на H1, тоест имаме основание да твърдим.


# Задача 78. За определяне на съдържанието на примеси в сплави на стомана съществуват
# два метода. В 8 проби е определено съдържанието на примеси по всеки от двата метода.
# Данните са следните:
#   Проба Метод 1 Метод 2
# 1 1.2 1.4
# 2 1.3 1.7
# 3 1.5 1.5
# 4 1.4 1.3
# 5 1.7 2.0
# 6 1.8 2.1
# 7 1.4 1.7
# 8 1.3 1.6
# Считаме, че данните са от нормално разпределение. Може ли да се приеме, че двата метода
# дават в средно едни и същи резултати?

# Двете проби са зависими
# mu_X = средно съдържание на примеси при определяне по метод 1
# mu_Y = средно съдържание на примеси при определяне по метод 2
# H0: mu_X = mu_Y
# H1: mu_X != mu_Y

x <- c(1.2, 1.3, 1.5, 1.4, 1.7, 1.8, 1.4, 1.3)
y <- c(1.4, 1.7, 1.5, 1.3, 2.0, 2.1, 1.7, 1.6)
t.test(x, y, paired=T)$p.value < 0.05
# => Не може да се приеме

d <- x - y
n <- length(x)
t.obs <- mean(d) / (sd(d)/sqrt(n))
t.obs
p.value <- 2*(1-pt(abs(t.obs), n-1))
p.value








# Задача 79. За да се сравни скоростта на четене при различни шрифтове, 
# на две групи от по 50 човека е даден един и същи текст, но на първата 
# бил написан с един шрифт, а на втората с друг. Регистрирано е времето, 
# за което всеки участник е прочел текста. Резултатите са:  
# за първата група – средно 7.88 минути и стандартно отклонение 1.73; 
# за втората група – средно 8.48 и стандартно отклонение 2.12. 
# Може ли да се твърди, че средното време за четене е различно за двата шрифта?

# mu_X = средно време за четене на първия шрифт
# mu_Y = средно време за четене на втория шрифт
# H0: mu_X = mu_Y
# H1: mu_x != mu_Y

x.bar <- 7.88
x.s <- 1.73
n <- 50

y.bar <- 8.48
y.s <- 2.12
m <- 50

t.obs <- (x.bar - y.bar) / sqrt(x.s^2/n + y.s^2/m)
t.obs
df <- (x.s^2/n + y.s^2/m)^2 / (((x.s^2/n)^2)/(n-1) + ((y.s^2/m)^2)/(m-1))

p.value <- 2*(1-pt(abs(t.obs), df))
p.value < 0.05

# => нямаме основание да отхвърлим нулевата хипотеза.
# Нямаме основание да твърдим, че средното време за четене  
# е различно за двата шрифта.



# Задача 81. Кадмият е тежък метал, който може да се натрупа до високи нива в гъбите.
# Измерена е концентрацията на кадмий в случайна извадка от 10 горски гъби събрани в
# дадена местност. Резултатите са следните (в мг/кг):
#   3.1 3.0 3.7 2.6 4.2 3.8 3.6 2.7 3.8 4.4
# Може да предположим, че концентрацията на кадмий е нормално разпределена.
# а) Намерете 95-процентен доверителен интервал за средната концентрация на кадмий
# в горските гъбите в дадената местност.
# б) Намерете 90-процентен доверителен интервал за средната концентрация на кадмий
# в горските гъбите в дадената местност.



